EDT/УТ/src/Reports/СтруктураВыручкиПоПериодамИВесовымКатегориям/СтруктураВыручкиПоПериодамИВесовымКатегориям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СтруктураВыручкиПоПериодамИВесовымКатегориям</name>
  <attributes>
    <name>ТерминалДоставки1</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалПриёма1</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Топ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

EDT/УТ/src/AccumulationRegisters/ЗакрытыеЗаказы/ЗакрытыеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗакрытыеЗаказы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаОценочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БанковскаяКомиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовоеОбслуживание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЧастичногоВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоКлиентовНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскоеВознаграждение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСДЧистые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховойСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабораПоЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгруженныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОценочнаяПоТоварно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПодъемаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоТарифицируемыхРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВознаграждениеАгентаПоПредоплаченнымЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФрахтЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Списание</name>
    <type>
      <types>DocumentRef.СписаниеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оприходование</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозврата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтклоненияЗаказа</name>
    <comment>Причина отклонения заказа в системе</comment>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалПриёма</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодъемныйБрейк</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Reports/СтруктураВыручкиПоПериодамИВесовымКатегориям/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка=ЛОжь;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки,ДанныеРасшифровки);
	
	ВнешниеНаборыДанных = Новый Структура;
	
	ТаблицаВнешнегоНабораДанных = ПолучитьТаблицуВнешнегоНабораДанных();
	ВнешниеНаборыДанных.Вставить("ТаблицаВнешнегоНабораДанных",ТаблицаВнешнегоНабораДанных);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,,Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ПроцессорВывода.НачатьВывод();
    Шаг = 0;
	
	ТабМагазин = ТаблицаВнешнегоНабораДанных.Скопировать();
	ТабМагазин.Свернуть("ОтМесяц,Показатель,Топ,ИнтернетМагазин", "Знач");
	ТабМагазин.Сортировать("ОтМесяц Возр");
	
	ТабМесяц = ТаблицаВнешнегоНабораДанных.Скопировать();
	ТабМесяц.Свернуть("ОтМесяц");
	ТабМесяц.Сортировать("ОтМесяц Возр");
						
    Пока Истина Цикл
        
        ЭлементРезультата = ПроцессорКомпоновки.Следующий();
        
        Если ЭлементРезультата = Неопределено Тогда
            Прервать;
        КонецЕсли; 
        
        Если ЭлементРезультата.ЗначенияПараметров.Количество() > 0 Тогда 
            
            Для каждого ПараметрМакета Из МакетКомпоновки.Макеты[ЭлементРезультата.Макет].Параметры Цикл
                
                Если ТипЗнч(ПараметрМакета) = Тип("ПараметрОбластиВыражениеКомпоновкиДанных") Тогда
                    Если ПараметрМакета.Выражение = "НаборДанных2.Показатель" И ЭлементРезультата.ЗначенияПараметров[0].Значение = "Количество выполненных заказов" Тогда
						Шаг = 6;
					КонецЕсли;
					Если ПараметрМакета.Выражение = "НаборДанных2.Показатель" Тогда
					    Для каждого Элем Из ЭлементРезультата.ЗначенияПараметров Цикл
							Если Элем.Значение = "Средний чек" Тогда
								Шаг = 1;
								Если Шаг = 1 Тогда
									ТабПоказатель = ТаблицаВнешнегоНабораДанных.Скопировать();
									ТабПоказатель.Свернуть("ОтМесяц, Показатель", "Знач");
									ТабПоказатель.Сортировать("ОтМесяц Возр");
									Выручка = Неопределено;
									Количество = Неопределено;
									СВыручка = 0;
									СКоличество = 0;
									Для каждого Стр из ТабПоказатель Цикл
										Если Стр.Показатель = "Выручка" Тогда
											Выручка = Стр.Знач;
											СВыручка = СВыручка + Выручка;
										КонецЕсли;
										Если Стр.Показатель = "Количество выполненных заказов" Тогда
											Количество = Стр.Знач;
											СКоличество = СКоличество + Количество;
										КонецЕсли;
										Если Выручка <> Неопределено И Количество <> Неопределено Тогда
											ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
											ЭлементРезультата = ПроцессорКомпоновки.Следующий();
											ЭлементРезультата.ЗначенияПараметров[0].Значение = ДелениеЗначений(Выручка,Количество);
											Выручка = Неопределено;
											Количество = Неопределено;
										КонецЕсли;
									КонецЦикла;
									Шаг = 2;
									ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
									ЭлементРезультата = ПроцессорКомпоновки.Следующий();
									ЭлементРезультата.ЗначенияПараметров[0].Значение = ДелениеЗначений(СВыручка,СКоличество);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					Если Шаг = 2 Тогда
						Если ПараметрМакета.Выражение = "НаборДанных2.Топ" Тогда
							ТопЗн = ЭлементРезультата.ЗначенияПараметров[0].Значение;
							ТабПоказатель = ТаблицаВнешнегоНабораДанных.Скопировать();
							ТабПоказатель.Свернуть("ОтМесяц,Показатель,Топ", "Знач");
							ТабПоказатель.Сортировать("ОтМесяц Возр");
							
							Выручка = Неопределено;
							Количество = Неопределено;
							СВыручка = 0;
							СКоличество = 0;
							Для каждого Стр из ТабПоказатель Цикл
								Если Стр.Показатель = "Выручка" И Стр.Топ = ТопЗн Тогда
									Выручка = Стр.Знач;
									СВыручка = СВыручка + Выручка;
								КонецЕсли;
								Если Стр.Топ = ТопЗн И Стр.Показатель = "Количество выполненных заказов" Тогда
									Количество = Стр.Знач;
									СКоличество = СКоличество + Количество;
								КонецЕсли;
								Если Выручка <> Неопределено И Количество <> Неопределено Тогда
									ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
									ЭлементРезультата = ПроцессорКомпоновки.Следующий();
									ЭлементРезультата.ЗначенияПараметров[0].Значение = ДелениеЗначений(Выручка,Количество);
									Выручка = Неопределено;
									Количество = Неопределено;
								КонецЕсли;
							КонецЦикла;
							ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
							ЭлементРезультата = ПроцессорКомпоновки.Следующий();
							ЭлементРезультата.ЗначенияПараметров[0].Значение = ДелениеЗначений(СВыручка,СКоличество);
							
						КонецЕсли;
					КонецЕсли;	
					Если Шаг = 2 И ПараметрМакета.Выражение = "НаборДанных2.ИнтернетМагазин" Тогда
						Магазин = ЭлементРезультата.ЗначенияПараметров[0].Значение;
						СВыручка = 0;
						СКоличество = 0;
						Для каждого Стр из ТабМесяц Цикл
							Отбор = Новый Структура;
							Отбор.Вставить("ОтМесяц", Стр.ОтМесяц);
							Отбор.Вставить("ИнтернетМагазин", Магазин);
							Отбор.Вставить("Показатель", "Выручка");
							НайденнаяСтрока = ТабМагазин.Скопировать(Отбор);
							Если НайденнаяСтрока.Количество() = 0 Тогда
								Цифра = 0;
							Иначе
								Цифра = НайденнаяСтрока[0].Знач;
							КонецЕсли;
							Выручка = Цифра;
							СВыручка = СВыручка + Выручка;
							
							Отбор = Новый Структура;
							Отбор.Вставить("ОтМесяц", Стр.ОтМесяц);
							Отбор.Вставить("ИнтернетМагазин", Магазин);
							Отбор.Вставить("Показатель", "Количество выполненных заказов");
							НайденнаяСтрока = ТабМагазин.Скопировать(Отбор);
							Если НайденнаяСтрока.Количество() = 0 Тогда
								Цифра = 0;
							Иначе
								Цифра = НайденнаяСтрока[0].Знач;
							КонецЕсли;
							Количество = Цифра;
							СКоличество = СКоличество + Количество;
							
							ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
							ЭлементРезультата = ПроцессорКомпоновки.Следующий();
							ЭлементРезультата.ЗначенияПараметров[0].Значение = ДелениеЗначений(Выручка,Количество);
						КонецЦикла;
						
						ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
						ЭлементРезультата = ПроцессорКомпоновки.Следующий();
						ЭлементРезультата.ЗначенияПараметров[0].Значение = ДелениеЗначений(СВыручка,СКоличество);
						
					КонецЕсли;
                КонецЕсли;    
            
			КонецЦикла;
            
        КонецЕсли;
        
        ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
        
    КонецЦикла;   
        
    ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

Функция ДелениеЗначений(Выручка,Количество)
	Если Количество <> 0 Тогда
		Возврат Выручка / Количество;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции

Функция ПолучитьТаблицуВнешнегоНабораДанных()
	
	ТаблицаОснова = ПолучитьОновнуюТаблицу();
	ТабТопов = ПолучитьТопы(ТаблицаОснова);
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Т1.ИнтернетМагазин,
	            |	Т1.Показатель,
	            |	Т1.Топ
	            |ПОМЕСТИТЬ Топы
	            |ИЗ
	            |	&ТЗ1 КАК Т1
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	Т1.ИнтернетМагазин,
	            |	Т1.Знач,
	            |	Т1.Показатель,
	            |	Т1.ТипЗаказа,
	            |	Т1.Ключ,
	            |	Т1.Топ,
	            |	Т1.ОтМесяц
	            |ПОМЕСТИТЬ Основная
	            |ИЗ
	            |	&ТЗ2 КАК Т1
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	Основная.ИнтернетМагазин,
	            |	Основная.Знач,
	            |	Основная.Показатель,
	            |	Основная.ТипЗаказа,
	            |	Основная.ОтМесяц,
	            |	Топы.Топ,
	            |	Основная.Ключ
	            |ИЗ
	            |	Основная КАК Основная
	            |		ЛЕВОЕ СОЕДИНЕНИЕ Топы КАК Топы
	            |		ПО Основная.ИнтернетМагазин = Топы.ИнтернетМагазин
	            |			И Основная.Показатель = Топы.Показатель";
				
	Зап.УстановитьПараметр("ТЗ1", ТабТопов);
	Зап.УстановитьПараметр("ТЗ2", ТаблицаОснова);
	Возврат Зап.Выполнить().Выгрузить();	
КонецФункции

Функция ПолучитьТопы(ТаблицаОснова)
	
	Отчетная = ТаблицаОснова.Скопировать();
	Отчетная.Свернуть("ИнтернетМагазин,Показатель,Топ", "Знач");
	Отчетная.Сортировать("Показатель Возр, Знач Убыв");

	Показатель = Неопределено;
	Топ = 10;
	Номер = 0;
	Для каждого Стр из Отчетная Цикл
		Если Стр.Показатель <> Показатель Тогда
			//ТипЗаказа = Стр.ТипЗаказа;
			Показатель = Стр.Показатель;
			Номер = 0;	
		КонецЕсли;
		Если Номер < Топ Тогда
			Стр.Топ = "Топ";
		КонецЕсли;		
		Номер = Номер + 1;		
	КонецЦикла;
	Возврат Отчетная;	
КонецФункции

Функция ПолучитьОновнуюТаблицу()
	Добавка = "";
	Если Не ТерминалДоставки1.Пустая() Тогда
		
		Если ТерминалДоставки1 = Справочники.РегиональныеТерминалы.МоскваСтриж Тогда
			Добавка = Добавка +"
			|	И (ЗакрытыеЗаказы.ТерминалДоставки = &ТерминалДоставки ИЛИ ЗакрытыеЗаказы.ТерминалДоставки = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка))";
		Иначе
			Добавка = Добавка +"
		|	И ЗакрытыеЗаказы.ТерминалДоставки = &ТерминалДоставки";
		КонецЕсли;
	КонецЕсли;
	Если Не ТерминалПриёма1.Пустая() Тогда
		Если ТерминалПриёма1 = Справочники.РегиональныеТерминалы.МоскваСтриж Тогда
			Добавка = Добавка +"
			|	И (ЗакрытыеЗаказы.ТерминалПриёма = &ТерминалПриёма ИЛИ ЗакрытыеЗаказы.ТерминалПриёма = ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.ПустаяСсылка))";
		Иначе
			Добавка = Добавка +"
		|	И ЗакрытыеЗаказы.ТерминалПриёма = &ТерминалПриёма";
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 50
	|						ТОГДА ""КГТ-2 (50+ кг)""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 30
	|						ТОГДА ""КГТ-1 (30-50 кг)""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 15
	|						ТОГДА ""СГТ-2 (15-30 кг)""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 10
	|						ТОГДА ""СГТ-1 (10-15 кг)""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 5
	|						ТОГДА ""МГТ-3 (5-10 кг)""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 2
	|						ТОГДА ""МГТ-2 (2-5 кг)""
	|					ИНАЧЕ ""МГТ-1 (0-2 кг)""
	|				КОНЕЦ
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытыеЗаказы.ОбъемЗабора > 1
	|						ТОГДА ""Забор от 1 м3""
	|					ИНАЧЕ ""Забор до 1 м3""
	|				КОНЕЦ
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Самовывоз)
	|			ТОГДА ""Самовывоз""
	|		ИНАЧЕ ""Фрахт""
	|	КОНЕЦ КАК ТипЗаказа,
	|	ВЫБОР
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 50
	|						ТОГДА ""07""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 30
	|						ТОГДА ""06""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 15
	|						ТОГДА ""05""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 10
	|						ТОГДА ""04""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 5
	|						ТОГДА ""03""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 2
	|						ТОГДА ""02""
	|					ИНАЧЕ ""01""
	|				КОНЕЦ
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытыеЗаказы.ОбъемЗабора > 1
	|						ТОГДА ""09""
	|					ИНАЧЕ ""08""
	|				КОНЕЦ
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Самовывоз)
	|			ТОГДА ""10""
	|		ИНАЧЕ ""11""
	|	КОНЕЦ КАК Ключ,
	|	СУММА(ЗакрытыеЗаказы.УслугиСД + ЗакрытыеЗаказы.БанковскаяКомиссия + ЗакрытыеЗаказы.КассовоеОбслуживание + ЗакрытыеЗаказы.АгентскоеВознаграждение) КАК ИтогоВыручка,
	|	НАЧАЛОПЕРИОДА(ЗакрытыеЗаказы.Период, МЕСЯЦ) КАК ОтМесяц,
	//+++ БАО 23.08.2017 №1570
	//---|	КОЛИЧЕСТВО(ЗакрытыеЗаказы.Регистратор) КАК КоличествоВыполненныхЗаказов,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗакрытыеЗаказы.Реализация) КАК КоличествоВыполненныхЗаказов,
	//--- БАО 23.08.2017 №1570
	|	ЗакрытыеЗаказы.Партнер КАК ИнтернетМагазин
	|ПОМЕСТИТЬ ВТ_Основа
	|ИЗ
	|	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	|ГДЕ
	|	ЗакрытыеЗаказы.СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказЗакрыт)
	|	И ЗакрытыеЗаказы.Период МЕЖДУ &ДатаНач И &ДатаКон" + Добавка + "
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ЗакрытыеЗаказы.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 50
	|						ТОГДА ""КГТ-2 (50+ кг)""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 30
	|						ТОГДА ""КГТ-1 (30-50 кг)""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 15
	|						ТОГДА ""СГТ-2 (15-30 кг)""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 10
	|						ТОГДА ""СГТ-1 (10-15 кг)""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 5
	|						ТОГДА ""МГТ-3 (5-10 кг)""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 2
	|						ТОГДА ""МГТ-2 (2-5 кг)""
	|					ИНАЧЕ ""МГТ-1 (0-2 кг)""
	|				КОНЕЦ
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытыеЗаказы.ОбъемЗабора > 1
	|						ТОГДА ""Забор от 1 м3""
	|					ИНАЧЕ ""Забор до 1 м3""
	|				КОНЕЦ
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Самовывоз)
	|			ТОГДА ""Самовывоз""
	|		ИНАЧЕ ""Фрахт""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 50
	|						ТОГДА ""07""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 30
	|						ТОГДА ""06""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 15
	|						ТОГДА ""05""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 10
	|						ТОГДА ""04""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 5
	|						ТОГДА ""03""
	|					КОГДА ЗакрытыеЗаказы.ТарифицируемыйВес > 2
	|						ТОГДА ""02""
	|					ИНАЧЕ ""01""
	|				КОНЕЦ
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытыеЗаказы.ОбъемЗабора > 1
	|						ТОГДА ""09""
	|					ИНАЧЕ ""08""
	|				КОНЕЦ
	|		КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Самовывоз)
	|			ТОГДА ""10""
	|		ИНАЧЕ ""11""
	|	КОНЕЦ,
	|	ЗакрытыеЗаказы.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основа.ТипЗаказа КАК ТипЗаказа,
	|	ВТ_Основа.ИтогоВыручка КАК ИтогоВыручка,
	|	ВТ_Основа.ИтогоВыручка / ВТ_Основа.КоличествоВыполненныхЗаказов КАК СреднийЧек,
	|	ВТ_Основа.ОтМесяц КАК ОтМесяц,
	|	ВТ_Основа.КоличествоВыполненныхЗаказов КАК КоличествоВыполненныхЗаказов,
	|	ВТ_Основа.ИнтернетМагазин КАК ИнтернетМагазин,
	|	ВТ_Основа.Ключ КАК Ключ
	|ПОМЕСТИТЬ ВТ_ДляРазбивки
	|ИЗ
	|	ВТ_Основа КАК ВТ_Основа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДляРазбивки.ТипЗаказа КАК ТипЗаказа,
	|	ВТ_ДляРазбивки.ОтМесяц КАК ОтМесяц,
	|	ВТ_ДляРазбивки.ИнтернетМагазин КАК ИнтернетМагазин,
	|	ВТ_ДляРазбивки.КоличествоВыполненныхЗаказов КАК Знач,
	|	""Количество выполненных заказов"" КАК Показатель,
	|	ВТ_ДляРазбивки.Ключ КАК Ключ,
	|	""Прочие"" КАК Топ
	|ИЗ
	|	ВТ_ДляРазбивки КАК ВТ_ДляРазбивки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДляРазбивки.ТипЗаказа,
	|	ВТ_ДляРазбивки.ОтМесяц,
	|	ВТ_ДляРазбивки.ИнтернетМагазин,
	|	ВТ_ДляРазбивки.СреднийЧек,
	|	""Средний чек"",
	|	ВТ_ДляРазбивки.Ключ,
	|	""Прочие""
	|ИЗ
	|	ВТ_ДляРазбивки КАК ВТ_ДляРазбивки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДляРазбивки.ТипЗаказа,
	|	ВТ_ДляРазбивки.ОтМесяц,
	|	ВТ_ДляРазбивки.ИнтернетМагазин,
	|	ВТ_ДляРазбивки.ИтогоВыручка,
	|	""Выручка"",
	|	ВТ_ДляРазбивки.Ключ,
	|	""Прочие""
	|ИЗ
	|	ВТ_ДляРазбивки КАК ВТ_ДляРазбивки";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ТерминалПриёма", ТерминалПриёма1);
	Запрос.УстановитьПараметр("ТерминалДоставки", ТерминалДоставки1);
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции
